{
  "backend/main.mo": "Motoko actor implementing the film project management backend with types for 8-phase workflow (Scale, BudgetLevel, TalentStrategy, etc.), CRUD operations for FilmProject records, phase updates, and insights management using Internet Computer stable storage.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (Next.js folder structure, inline documentation comments, and environment configuration) to their corresponding files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React + TanStack Router application structure with landing page, project list, project overview, 8 phase pages, navigation, dialogs, hooks, types, and styling.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining cinematic warm palette for light mode and deep cinematic palette for dark mode using CSS custom properties.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and root div mounting point.",
  "frontend/README.md": "Comprehensive frontend documentation explaining the React + Motoko architecture on Internet Computer, critical rules about frontend never accessing storage directly, single FilmProject model across all phases, and phase independence for parallel development.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with root layout (navigation and footer), landing page route, projects list route, project overview route, and 8 phase-specific routes.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog component with comprehensive form collecting all FilmProject fields (title, genre, scale, budget, talent strategy, audience type, marketing, distribution) and calling backend createFilmProject method with navigation to new project on success.",
  "frontend/src/components/Navigation.tsx": "Top-level navigation component providing links to home and projects pages, with a sticky header design. Phase-specific navigation is intentionally excluded and should be accessed through project overview pages.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the Internet Computer backend actor, creating authenticated or anonymous actors based on identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations including CRUD operations for film projects, phase updates, and insights management. All data operations go through the Motoko backend actor with proper cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a cinematic color palette for both light and dark modes, using warm tones and deep contrasts.",
  "frontend/src/lib/types.ts": "Frontend-specific type definitions that mirror backend types not exported by the backend, currently defining BudgetLevel enum.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section and feature highlights, introducing the film production platform and guiding users to the projects section.",
  "frontend/src/pages/Phase1Page.tsx": "Placeholder page for Phase 1 (Script Selection & Concept Evaluation) with TODO comments outlining required form fields, backend integration points, and AI insights functionality to be implemented.",
  "frontend/src/pages/Phase2Page.tsx": "Placeholder page for Phase 2 (Packaging & Pre-Production Strategy) with navigation back to project overview and TODO list for budget level, talent strategy, and production feasibility form inputs.",
  "frontend/src/pages/Phase3Page.tsx": "Placeholder page for Phase 3 (Production Phase) with navigation and TODO list for tracking planned/actual shoot days, production health status, and daily progress reports.",
  "frontend/src/pages/Phase4Page.tsx": "Placeholder page for Phase 4 (Post-Production & Market Testing) with navigation and TODO list for audience type, interest score, test strategy, and feedback collection inputs.",
  "frontend/src/pages/Phase5Page.tsx": "Placeholder page for Phase 5 (Marketing Strategy Planning) with navigation and TODO list for marketing budget level, primary channel, risk assessment, and campaign planning inputs.",
  "frontend/src/pages/Phase6Page.tsx": "Placeholder page for Phase 6 (Distribution Strategy & Negotiation) with navigation and TODO list for release model, distribution confidence, deal tracking, and territory planning inputs.",
  "frontend/src/pages/Phase7Page.tsx": "Placeholder page for Phase 7 (Release & Discoverability) with navigation and TODO list for release window selection, competition level, discoverability risk, and launch campaign coordination.",
  "frontend/src/pages/Phase8Page.tsx": "Placeholder page for Phase 8 (Post-Release Optimization & Monetization) with navigation and TODO list for audience response, monetization options, learning summary, and performance analytics.",
  "frontend/src/pages/ProjectListPage.tsx": "Displays all film projects in a grid with metadata (title, genre, scale, budget, phase), includes create project dialog, and handles navigation to individual project overview pages.",
  "frontend/src/pages/ProjectOverviewPage.tsx": "Central hub page displaying comprehensive project details and providing navigation links to all 8 phase-specific workflow pages with loading and error states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines a custom design system with OKLCH color variables, extended theme including sidebar/chart colors, custom border radius, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a Film Producer Decision Support Platform with architectural notes emphasizing Flask-only database access, Next.js frontend, 8-phase film lifecycle workflow, and tracking of existing features and requirements."
}