{
  "backend/main.mo": "Motoko actor implementing the film project management backend with types for 8-phase workflow (Scale, BudgetLevel, TalentStrategy, etc.), CRUD operations for FilmProject records, phase progression, insights management, and query methods for projects and insights.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend files including React components, pages for 8 phases, hooks, types, configuration, and documentation.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode variables for cinematic warm palette including background, foreground, primary, secondary, accent, and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Film Producer Decision Support Platform.",
  "frontend/README.md": "Frontend documentation explaining React + Motoko architecture on Internet Computer, critical rules about storage access through backend only, single FilmProject model for all phases, and phase independence principles.",
  "frontend/src/App.tsx": "Main application component using TanStack Router to define all routes (landing, projects list, project overview, and 8 phase pages) with shared layout including Navigation header and footer with caffeine.ai attribution.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog component with comprehensive form collecting all FilmProject fields (title, genre, scale, budgetLevel, talentStrategy, etc.) and calling backend createFilmProject mutation with navigation to new project on success.",
  "frontend/src/components/Navigation.tsx": "Header navigation component with FilmFlow Studio branding, links to home and projects pages, and architecture notes emphasizing phase independence and extension approach.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication, invalidating dependent queries when the actor changes based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing identity state and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations including CRUD operations for film projects, phase updates, and insights management, ensuring all data flows through the Motoko backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a cinematic color palette for both light and dark modes using HSL color space.",
  "frontend/src/lib/types.ts": "Frontend type definitions for types used in the UI but not exported by the backend, currently defining BudgetLevel enum mirroring backend's internal types.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, rendering the root App component.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page showcasing the film production platform's value proposition with hero section, feature highlights, and navigation to projects.",
  "frontend/src/pages/Phase1Page.tsx": "Placeholder page for Phase 1 (Script Selection & Concept Evaluation) with TODO comments outlining required form inputs for concept risk assessment, target audience, and go/no-go decisions.",
  "frontend/src/pages/Phase2Page.tsx": "Placeholder page for Phase 2 (Packaging & Pre-Production Strategy) with TODO comments outlining required form inputs for budget planning, talent strategy, and production feasibility assessment.",
  "frontend/src/pages/Phase3Page.tsx": "Placeholder page for Phase 3 (Production Phase) that displays a TODO card listing fields for tracking planned/actual shoot days, production health status, and daily progress reports.",
  "frontend/src/pages/Phase4Page.tsx": "Placeholder page for Phase 4 (Post-Production & Market Testing) that displays a TODO card listing fields for audience type, interest score, test strategy, and feedback collection.",
  "frontend/src/pages/Phase5Page.tsx": "Placeholder page for Phase 5 (Marketing Strategy Planning) that displays a TODO card listing fields for marketing budget level, primary channel, risk assessment, and campaign planning.",
  "frontend/src/pages/Phase6Page.tsx": "Placeholder page for Phase 6 (Distribution Strategy & Negotiation) that displays a TODO card listing fields for release model, distribution confidence, deal tracking, and territory planning.",
  "frontend/src/pages/Phase7Page.tsx": "Placeholder page for Phase 7 (Release & Discoverability) that displays a TODO card listing fields for release window selection, competition level, discoverability risk, and launch campaign coordination.",
  "frontend/src/pages/Phase8Page.tsx": "Placeholder page for Phase 8 (Post-Release Optimization & Monetization) that displays a TODO card listing fields for audience response, monetization options, learning summary, and performance analytics.",
  "frontend/src/pages/ProjectListPage.tsx": "Displays all film projects in a grid with key metadata (title, genre, scale, budget, phase), includes a create project dialog, and provides navigation to individual project overview pages.",
  "frontend/src/pages/ProjectOverviewPage.tsx": "Central hub page displaying comprehensive project details and navigation buttons to all 8 phase-specific workflow pages, with project metadata organized in cards.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom animations (accordion), border radius variables, and includes typography, container queries, and animate plugins.",
  "frontend/tsconfig.node.json": "TypeScript configuration for Node.js build tools (Vite) with ESNext module settings, bundler resolution, and synthetic default imports enabled.",
  "project_state.json": "Project state file documenting a Film Producer Decision Support Platform with Next.js frontend, Flask backend, and Neon PostgreSQL database, emphasizing architectural boundaries where Flask is the only service accessing the database and handling all business logic across 8 film lifecycle phases."
}