{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix empty package.json and add required dependencies",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Create complete frontend/package.json with all required dependencies for React + Internet Computer application",
      "acceptanceCriteria": [
        "package.json exists in frontend directory with non-empty content",
        "All React and TypeScript dependencies are present with compatible versions",
        "All Internet Computer dependencies (@dfinity packages) are included",
        "TanStack Router and TanStack Query are listed as dependencies",
        "Tailwind CSS and related build tools are configured",
        "Scripts section includes dev, build, and preview commands",
        "npm install runs without errors in the frontend directory"
      ],
      "file_operations": [
        {
          "path": "frontend/package.json",
          "operation": "create",
          "description": "Use the build-template-react component to create a complete package.json with all required dependencies including React 18.x, TypeScript 5.x, Vite 5.x, TanStack Router (@tanstack/react-router), TanStack Query (@tanstack/react-query), all @dfinity packages (@dfinity/agent, @dfinity/auth-client, @dfinity/candid, @dfinity/principal), Tailwind CSS with PostCSS and Autoprefixer, shadcn/ui dependencies (class-variance-authority, clsx, tailwind-merge, lucide-react, @radix-ui/* packages), and development dependencies including TypeScript, Vite plugins, ESLint, and type definitions. Include scripts for dev, build, preview, and type-check commands. Verify the component's usage instructions before implementing to ensure all dependencies match the existing codebase structure (TanStack Router setup, hooks patterns, component library)."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Create frontend/package-lock.json with resolved dependency tree matching the package.json configuration",
      "acceptanceCriteria": [
        "package-lock.json is generated with lockfileVersion 3",
        "All dependencies from package.json are resolved with specific versions",
        "Dependency tree includes all transitive dependencies",
        "File enables npm install to complete successfully without fetching issues"
      ],
      "file_operations": [
        {
          "path": "frontend/package-lock.json",
          "operation": "create",
          "description": "Use the build-template-react component to create a complete package-lock.json with lockfileVersion 3, containing the full resolved dependency tree for all packages specified in package.json. This file must include all transitive dependencies with integrity hashes and resolved URLs to enable npm install to execute without network fetching issues. The lock file should match the dependency versions specified in the package.json and ensure compatibility across the entire dependency graph including React, TypeScript, Vite, TanStack packages, @dfinity packages, Tailwind CSS, and shadcn/ui component dependencies. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Ensure frontend/vite.config.ts exists with proper configuration for React, TypeScript support, and Internet Computer environment variables",
      "acceptanceCriteria": [
        "Vite config file exists with React plugin configured",
        "Environment variable handling is configured for VITE_* or import.meta.env",
        "Build output directory and public directory are properly set",
        "Development server configuration is present"
      ],
      "file_operations": [
        {
          "path": "frontend/vite.config.ts",
          "operation": "modify",
          "description": "Use the build-template-react component and core-infrastructure component to ensure vite.config.ts includes the React plugin (@vitejs/plugin-react-swc), proper TypeScript configuration with path aliases (@ pointing to src), environment variable handling for Internet Computer canister IDs and network configuration (DFX_NETWORK, CANISTER_ID), build output directory set to dist, public directory configuration, and development server settings including port and proxy configuration for local canister communication. Verify both components' usage instructions before implementing to ensure proper integration with the Internet Computer backend connection."
        }
      ]
    }
  ]
}